app/views/tasks/_form.html.erb

<%= form_with(model: [Event.find(params[:event_id]), task]) do |f| %>
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]