app/views/tasks/_index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
---
      <% if !!task.user_id %>
        <h6 class="text-primary"> Assigned to: <%= User.find(task.user_id).name %>  </h6>