app/views/tasks/show.html.erb

    <h6 class="text-primary">
      Assigned to: <%= User.find(@task.user_id).name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]

  <%# Check User is valid admin or not %>
  <% if current_user.id == Event.find(@task.event_id).user_id %>
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]