app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 27]]
---
  def index
    @events = current_user.events.all

INSERT INTO "events" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Hard-Party"], ["user_id", 27], ["created_at", "2022-05-07 18:27:51.171177"], ["updated_at", "2022-05-07 18:27:51.171177"]]
---
    def create
      @event = current_user.events.new(event_params)
      if @event.save

UPDATE "events" SET "name" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "Birthday-Rohit22"], ["updated_at", "2022-05-07 20:34:23.159495"], ["id", 1]]
---
    def update
      current_event
      if @event.update(event_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."event_id" = ? LIMIT ?  [["event_id", 1], ["LIMIT", 1]]
---
    def show
      current_event
      @tasks = @event.tasks.all

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 32]]
---
    def destroy
      current_event
      @name = @event.name
      destroy_current_event_tasks
      @event.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."event_id" = ?  [["event_id", 29]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 46]]
---
    def destroy_current_event_tasks
      @tasks = current_event.tasks.all
      @tasks.each do |task|
        task.destroy

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
---
    def current_event
      @event = Event.find(params[:id])