app/controllers/expenses_controller.rb

  def index
    @expenses = @task.expenses.all
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."task_id" = ?  [["task_id", 4]]

  def create
    @expense = @task.expenses.new(expense_params)
     if @expense.save
---
INSERT INTO "expenses" ("name", "amount", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "bucket"], ["amount", 100], ["task_id", 4], ["created_at", "2022-05-16 12:56:24.863714"], ["updated_at", "2022-05-16 12:56:24.863714"]]

  def update
    current_expense
    if @expense.update(expense_params)
---
UPDATE "expenses" SET "amount" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["amount", 3500], ["updated_at", "2022-05-16 13:06:16.194954"], ["id", 91]]

  def destroy
    current_expense
    @name = @expense.name
    @expense.destroy
---
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 90]]

  def current_event
    @event = Event.find(params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def current_task
    # @task = @event.tasks.find(params[:task_id])
    @task = Task.find(params[:task_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def current_expense
    @expense = @task.expenses.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."task_id" = ? AND "expenses"."id" = ? LIMIT ?  [["task_id", 4], ["id", 90], ["LIMIT", 1]]