app/controllers/tasks_controller.rb

  def destroy
    current_task
    destroy_current_task_expenses
    @name = @task.name
    @assigned_tasks = AssignedTask.where(task_id:current_task.id)
    @assigned_tasks.each do |assigned_task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]