app/controllers/tasks_controller.rb

  def index
    # @tasks = Task.all
    @tasks = @event.tasks.all
---
SELECT "tasks".* FROM "tasks"

  def create
    # @task = Task.new(name: task_params[:name], event_id: params[:event_id])
    @task = @event.tasks.new(task_params)
      if @task.save
---
INSERT INTO "tasks" ("name", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "{\"name\"=>\"kakashi\"}"], ["event_id", 1], ["created_at", "2022-05-16 11:16:01.708372"], ["updated_at", "2022-05-16 11:16:01.708372"]]

  def show
    current_task
    @expenses = current_task.expenses.all
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."task_id" = ?  [["task_id", 4]]

  def update
    current_task
    if @task.update(task_params)
---
UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "Picknik plan :- 1st"], ["updated_at", "2022-05-13 10:28:45.697603"], ["id", 4]]

  def destroy
    current_task
    @name = @task.name
    destroy_current_task_expenses
    @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 54]]

  def current_event
    @event = Event.find(params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def current_task
    @task = @event.tasks.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."event_id" = ? AND "tasks"."id" = ? LIMIT ?  [["event_id", 1], ["id", 4], ["LIMIT", 1]]

  def destroy_current_task_expenses
    @expenses = current_task.expenses.all
    @expenses.each do |expense|
      expense.destroy
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."task_id" = ?  [["task_id", 54]]
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 85]]